simulation/jmeter/spike.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!-- Spike test: ramp 5→100 users in 2 min, hold 5 min, ramp down -->
<!-- Usage: jmeter -n -t jmeter/spike.jmx -JHOST=karmyq.com -JPROTOCOL=https -JUSERS_CSV=/tmp/karmyq-users.csv -l results/spike-results.jtl -->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Karmyq Spike Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
    </TestPlan>
    <hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="User Credentials" enabled="true">
        <stringProp name="filename">${__P(USERS_CSV,/tmp/karmyq-users.csv)}</stringProp>
        <stringProp name="variableNames">USER_EMAIL,USER_PASSWORD</stringProp>
        <stringProp name="delimiter">,</stringProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
      </CSVDataSet>

      <!-- Ultimate Thread Group (or use bzm plugin) — approximate with standard stepping -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Spike Ramp Up" enabled="false"/>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Spike Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">10</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">420</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- Login + core API reads — same pattern as steady-state -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(HOST,karmyq.com)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(PROTOCOL,https)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/auth/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{"email":"${USER_EMAIL}","password":"${USER_PASSWORD}"}</stringProp>
                <stringProp name="Argument.name">body</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp>
            </collectionProp>
          </HeaderManager>
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testclass="JSONPathExtractor" testname="Extract Token">
            <stringProp name="JSONPathExtractor.refname">AUTH_TOKEN</stringProp>
            <stringProp name="JSONPathExtractor.jsonpath">$.data.token</stringProp>
          </JSONPathExtractor>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Browse Requests" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(HOST,karmyq.com)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(PROTOCOL,https)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/requests?limit=20</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth"><collectionProp name="HeaderManager.headers"><elementProp name="" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${AUTH_TOKEN}</stringProp></elementProp></collectionProp></HeaderManager>
        </hashTree>
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time"><stringProp name="RandomTimer.range">2000</stringProp><stringProp name="ConstantTimer.delay">500</stringProp></UniformRandomTimer>
      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/spike-results.jtl</stringProp>
      </ResultCollector>
    </hashTree>
  </hashTree>
</jmeterTestPlan>